УТ_для_edt.РасширениеСмарт/src/Catalogs/Склады/Склады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Склады</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТекущаяДолжностьОтветственного</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаНачалаОрдернойСхемыПриПоступлении</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриПоступлении</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаИспользованияСкладскихПомещений</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИспользованиеРабочихУчастков</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСкладскиеПомещения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦеховаяКладовая</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИсточникИнформацииОЦенахДляПечати</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>УчетныйВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РозничныйВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТекущийОтветственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Календарь</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСтатусыПриходныхОрдеров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаОрдернойСхемыПриОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИспользоватьСтатусыРасходныхОрдеров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаОрдернойСхемыПриОтраженииИзлишковНедостач</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаНачалаАдресногоХраненияОстатков</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИспользоватьСтатусыПересчетовТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтролироватьОперативныеОстатки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НастройкаАдресногоХранения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДляПоступленияГрузов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСерииНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="39299529-e597-4f8e-a8bf-4eb5dc180cbb">
    <name>ВыборГруппы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ff476f7c-83dd-4bf3-b877-ee64c1fc2c1c">
    <name>ИспользоватьАдресноеХранение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6058b2d6-0f5a-4298-8e5c-da1204a63027">
    <name>смартПриоритетДляСпособаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Enums/ВыборГруппыСкладов/ВыборГруппыСкладов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="7e07aac6-650f-48a2-a423-b41cb718c439">
  <name>ВыборГруппыСкладов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="8a3d674b-a66f-40bb-9356-0456e1e841be">
    <name>Запретить</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="00c8f6f5-a1b9-4566-9b39-0d7680ea3d94">
    <name>РазрешитьВЗаказахИНакладных</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="218ebcfd-6bec-4d57-a581-5742147320b9">
    <name>РазрешитьВЗаказах</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Склады/Forms/ФормаГруппы/Module.bsl
#Область ПеренесеноСДоработками

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура смарт_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	// подсистема запрета редактирования ключевых реквизитов объектов	
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);

	Элементы.ВыборГруппы.СписокВыбора.Очистить();
	Элементы.ВыборГруппы.СписокВыбора.Добавить(Перечисления.ВыборГруппыСкладов.Запретить);

	Если (Не ПолучитьФункциональнуюОпцию("ИспользоватьЗаказыКлиентов")
		И Не ПолучитьФункциональнуюОпцию("ИспользоватьЗаказыПоставщикам")) Тогда

		Элементы.ВыборГруппы.СписокВыбора.Добавить(Перечисления.ВыборГруппыСкладов.РазрешитьВЗаказахИНакладных, НСтр("ru='Разрешить в накладных'"));

	Иначе

		Элементы.ВыборГруппы.СписокВыбора.Добавить(Перечисления.ВыборГруппыСкладов.РазрешитьВЗаказах);
		Элементы.ВыборГруппы.СписокВыбора.Добавить(Перечисления.ВыборГруппыСкладов.РазрешитьВЗаказахИНакладных);

	КонецЕсли;

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

	#Вставка
	//++ #Б5778 смарт: Шляпников 24.02.2026 / Проект smart-t.ru. Доработать выгрузку складов
	Группа = смартФормированиеИнтерфейса.СздГруппаОбычная(ЭтаФорма, "смартГруппаВыгрузкаНаСайт", ЭтаФорма, "Параметры выгрузки на сайт", 1);
	
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартВыгружатьНаСайт", Группа,, 2, "Объект.смартВыгружатьНаСайт");
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартНаименованиеНаСайте", Группа,, 1, "Объект.смартНаименованиеНаСайте");
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартАдресНаСайте", Группа,, 1, "Объект.смартАдресНаСайте");
	
	Структура = Новый Структура("Склад", "Склад");
	смартФормированиеИнтерфейса.СздТаблицаФормы(ЭтаФорма, "смартСкладыОстатковДляСайта", Группа, "Объект.смартСкладыОстатковДляСайта", Структура);
	
	ЭтаФорма.УстановитьДействие("ПередЗаписьюНаСервере", "смарт_ПередЗаписьюНаСервере");
	//-- #Б5778 смарт: Шляпников 24.02.2026
	#КонецВставки
	
КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт

&НаСервере
Процедура смарт_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СкладысмартСкладыОстатковДляСайта.Ссылка КАК Ссылка,
	|	СкладысмартСкладыОстатковДляСайта.Склад КАК Склад
	|ИЗ
	|	Справочник.Склады.смартСкладыОстатковДляСайта КАК СкладысмартСкладыОстатковДляСайта
	|ГДЕ
	|	СкладысмартСкладыОстатковДляСайта.Склад В(&Склад)
	|	И СкладысмартСкладыОстатковДляСайта.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Склад", Объект.смартСкладыОстатковДляСайта.Выгрузить(, "Склад").ВыгрузитьКолонку("Склад"));
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Склад %1 уже включен в группу складов %2. Запись невозможна !", Выборка.Склад, Выборка.Ссылка),,,, Отказ);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
